artillery-workshop/demos/capture/example-com.yaml
config:
  target: "http://exmaple.com"
  phases:
    - duration: 1    # Number of seconds to run
      arrivalRate: 1 # Number of users per second
  processor:  'debugging.js'
scenarios:
  - flow:
      - get:
          url: "/"
          afterResponse: printBody
          beforeRequest: printRequest
          capture:
            xpath: /html/body/div/h1/text()
            as: heading